#+TITLE: Beginning Programming in JavaScript
#+AUTHOR: Clarissa Littler

#+OPTIONS: H:2 toc:nil
#+startup: beamer
#+BEAMER_THEME: Madrid
#+LaTeX_CLASS: beamer

*** 
 #+BEGIN_SRC js :exports code :results output
   var obj = {prop1 : 0, prop2 : 1};
   console.log(obj.prop1);
   console.log(obj.prop2);
   console.log(obj.prop3);
 #+END_SRC

 #+RESULTS:
 : 0
*** Answer
    #+BEGIN_SRC js :exports code :results output
      var obj = {name : "chicken", typeOfAnimal : "dog"};
      console.log(obj.name === "chicken");
      console.log(obj.typeOfAnimal === "dog");
    #+END_SRC

    #+RESULTS:
    : true
    : true
\pause
Are there any other answers?
*** Answer
#+BEGIN_SRC js :exports code :results output
  for(var i=3;i < 21; i = i + 1){
      console.log(i);
  }
#+END_SRC

#+RESULTS:
#+begin_example
3
4
5
6
7
8
9
10
11
12
13
14
15
16
17
18
19
20
#+end_example
** While-example
#+BEGIN_SRC js :exports code :results output
  var sum0 = 0;
  var sum1 = 1;
  while (sum1 < 1000) {
      console.log(sum0);
      var temp = sum1;
      sum1 = sum1 + sum0;
      sum0 = temp;
  }
#+END_SRC

#+RESULTS:
#+begin_example
0
1
1
1
1
2
2
3
3
5
5
8
8
13
13
21
21
34
34
55
55
89
89
144
144
233
233
377
377
610
610
987
#+end_example
*** 					
#+BEGIN_SRC js :exports code :results output
  var adding = function (x,y) {return x + y;};
  console.log(adding(1,2));
  var myObj = {};
  myObj.adder = adding;
  console.log(myObj.adder(1,2));
#+END_SRC

#+RESULTS:
: 3
: 3
*** 
Will the following code print =1= or =2=?
#+BEGIN_SRC js :exports code :results output
  var myVar = 0;
  var fun = function () {
      myVar = myVar + 1;
      return;
      myVar = myVar + 1;
  };
  fun();
  console.log(myVar);
#+END_SRC

#+RESULTS:
: 1
\pause
